test-results/load-test-tools/wrk2/coordinatedOmission.log
$ wrk -R 10000 -t 8 -c 200 -d 250s --timeout 60s --latency http://172.31.10.4:3001/api/json/coordinatedOmission

Running 4m test @ http://172.31.10.4:3001/api/json/coordinatedOmission
  8 threads and 200 connections
  Thread calibration: mean lat.: 2.078ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.984ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.154ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.129ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.180ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.644ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.676ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.617ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.14s    41.34s    1.67m    75.61%
    Req/Sec     0.98k     0.93k    3.33k    40.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.26ms
 75.000%    1.35m
 90.000%    1.54m
 99.000%    1.66m
 99.900%    1.67m
 99.990%    1.67m
 99.999%    1.67m
100.000%    1.67m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.311     0.000000            1         1.00
       1.499     0.100000       177767         1.11
       1.965     0.200000       355413         1.25
       2.453     0.300000       533388         1.43
       3.005     0.400000       710913         1.67
       4.259     0.500000       888142         2.00
   65601.535     0.550000       977574         2.22
   69468.159     0.600000      1066076         2.50
   73400.319     0.650000      1155515         2.86
   77266.943     0.700000      1243979         3.33
   81068.031     0.750000      1332397         4.00
   82968.575     0.775000      1376691         4.44
   84934.655     0.800000      1422214         5.00
   86835.199     0.825000      1465987         5.71
   88735.743     0.850000      1510609         6.67
   90636.287     0.875000      1554906         8.00
   91619.327     0.887500      1577698         8.89
   92536.831     0.900000      1598998        10.00
   93519.871     0.912500      1621898        11.43
   94437.375     0.925000      1643198        13.33
   95420.415     0.937500      1666140        16.00
   95879.167     0.943750      1676703        17.78
   96403.455     0.950000      1688768        20.00
   96862.207     0.956250      1699386        22.86
   97320.959     0.962500      1709987        26.67
   97779.711     0.968750      1720776        32.00
   98041.855     0.971875      1726808        35.56
   98303.999     0.975000      1732864        40.00
   98566.143     0.978125      1738959        45.71
   98762.751     0.981250      1743496        53.33
   99024.895     0.984375      1749545        64.00
   99155.967     0.985938      1752589        71.11
   99287.039     0.987500      1755589        80.00
   99352.575     0.989062      1757118        91.43
   99483.647     0.990625      1760156       106.67
   99614.719     0.992188      1763163       128.00
   99680.255     0.992969      1764733       142.22
   99745.791     0.993750      1766249       160.00
   99811.327     0.994531      1767789       182.86
   99876.863     0.995313      1769320       213.33
   99942.399     0.996094      1770858       256.00
   99942.399     0.996484      1770858       284.44
   99942.399     0.996875      1770858       320.00
  100007.935     0.997266      1773808       365.71
  100007.935     0.997656      1773808       426.67
  100007.935     0.998047      1773808       512.00
  100007.935     0.998242      1773808       568.89
  100007.935     0.998437      1773808       640.00
  100073.471     0.998633      1776280       731.43
  100073.471     1.000000      1776280          inf
#[Mean    =    40135.254, StdDeviation   =    41340.491]
#[Max     =   100007.936, Total count    =      1776280]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1877016 requests in 4.17m, 716.03MB read
Requests/sec:   7508.04
Transfer/sec:      2.86MB