test-results/load-test-tools/wrk2/nginx-status_R200000_t8_c200_d30.log
- client: AWS c5.2xlarge * 1, 8C16G, 10Gbps
- server: AWS c5.2xlarge * 1, 8C16G, 10Gbps

$ wrk --version
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer


$ wrk -R 200000 -t 8 -c 200 -d 30s --timeout 2s --latency http://172.31.10.3/nginx-status

Running 30s test @ http://172.31.10.3/nginx-status
  8 threads and 200 connections
  Thread calibration: mean lat.: 1.223ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.255ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.294ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.322ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.303ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.291ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.319ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.300ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.29ms  656.93us   4.26ms   64.95%
    Req/Sec    26.31k     1.75k   33.00k    68.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.73ms
 90.000%    2.20ms
 99.000%    2.93ms
 99.900%    3.32ms
 99.990%    3.55ms
 99.999%    3.78ms
100.000%    4.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.053     0.000000            1         1.00
       0.445     0.100000       397961         1.11
       0.678     0.200000       795989         1.25
       0.873     0.300000      1192778         1.43
       1.062     0.400000      1591947         1.67
       1.231     0.500000      1988466         2.00
       1.315     0.550000      2186294         2.22
       1.404     0.600000      2385053         2.50
       1.501     0.650000      2584349         2.86
       1.608     0.700000      2783034         3.33
       1.729     0.750000      2982042         4.00
       1.795     0.775000      3081655         4.44
       1.865     0.800000      3180903         5.00
       1.940     0.825000      3279344         5.71
       2.022     0.850000      3379254         6.67
       2.111     0.875000      3480206         8.00
       2.155     0.887500      3528194         8.89
       2.203     0.900000      3579296        10.00
       2.253     0.912500      3628904        11.43
       2.307     0.925000      3677666        13.33
       2.369     0.937500      3727479        16.00
       2.403     0.943750      3751539        17.78
       2.443     0.950000      3776898        20.00
       2.487     0.956250      3802150        22.86
       2.535     0.962500      3825977        26.67
       2.595     0.968750      3850859        32.00
       2.629     0.971875      3863244        35.56
       2.667     0.975000      3875611        40.00
       2.711     0.978125      3888360        45.71
       2.759     0.981250      3900780        53.33
       2.813     0.984375      3913114        64.00
       2.841     0.985938      3919111        71.11
       2.873     0.987500      3925381        80.00
       2.909     0.989062      3931705        91.43
       2.947     0.990625      3937921       106.67
       2.989     0.992188      3944029       128.00
       3.013     0.992969      3947179       142.22
       3.039     0.993750      3950255       160.00
       3.065     0.994531      3953221       182.86
       3.097     0.995313      3956507       213.33
       3.129     0.996094      3959465       256.00
       3.147     0.996484      3961028       284.44
       3.165     0.996875      3962564       320.00
       3.187     0.997266      3964226       365.71
       3.209     0.997656      3965696       426.67
       3.235     0.998047      3967272       512.00
       3.249     0.998242      3968025       568.89
       3.263     0.998437      3968772       640.00
       3.279     0.998633      3969530       731.43
       3.297     0.998828      3970304       853.33
       3.319     0.999023      3971124      1024.00
       3.331     0.999121      3971525      1137.78
       3.343     0.999219      3971866      1280.00
       3.357     0.999316      3972255      1462.86
       3.375     0.999414      3972662      1706.67
       3.393     0.999512      3973046      2048.00
       3.403     0.999561      3973218      2275.56
       3.417     0.999609      3973428      2560.00
       3.431     0.999658      3973618      2925.71
       3.447     0.999707      3973795      3413.33
       3.465     0.999756      3974003      4096.00
       3.477     0.999780      3974105      4551.11
       3.485     0.999805      3974184      5120.00
       3.499     0.999829      3974285      5851.43
       3.515     0.999854      3974377      6826.67
       3.533     0.999878      3974479      8192.00
       3.541     0.999890      3974526      9102.22
       3.555     0.999902      3974575     10240.00
       3.571     0.999915      3974624     11702.86
       3.585     0.999927      3974668     13653.33
       3.603     0.999939      3974720     16384.00
       3.615     0.999945      3974744     18204.44
       3.625     0.999951      3974768     20480.00
       3.641     0.999957      3974792     23405.71
       3.655     0.999963      3974814     27306.67
       3.673     0.999969      3974840     32768.00
       3.683     0.999973      3974850     36408.89
       3.701     0.999976      3974865     40960.00
       3.713     0.999979      3974875     46811.43
       3.729     0.999982      3974887     54613.33
       3.747     0.999985      3974899     65536.00
       3.755     0.999986      3974906     72817.78
       3.765     0.999988      3974911     81920.00
       3.771     0.999989      3974917     93622.86
       3.793     0.999991      3974924    109226.67
       3.813     0.999992      3974929    131072.00
       3.839     0.999993      3974932    145635.56
       3.843     0.999994      3974935    163840.00
       3.875     0.999995      3974938    187245.71
       3.897     0.999995      3974941    218453.33
       3.913     0.999996      3974944    262144.00
       3.919     0.999997      3974946    291271.11
       3.927     0.999997      3974947    327680.00
       3.937     0.999997      3974949    374491.43
       3.945     0.999998      3974950    436906.67
       3.969     0.999998      3974952    524288.00
       3.979     0.999998      3974953    582542.22
       3.979     0.999998      3974953    655360.00
       3.993     0.999999      3974954    748982.86
       3.999     0.999999      3974955    873813.33
       4.011     0.999999      3974956   1048576.00
       4.011     0.999999      3974956   1165084.44
       4.011     0.999999      3974956   1310720.00
       4.021     0.999999      3974957   1497965.71
       4.021     0.999999      3974957   1747626.67
       4.247     1.000000      3974958   2097152.00
       4.247     1.000000      3974958   2330168.89
       4.247     1.000000      3974958   2621440.00
       4.247     1.000000      3974958   2995931.43
       4.247     1.000000      3974958   3495253.33
       4.263     1.000000      3974959   4194304.00
       4.263     1.000000      3974959          inf
#[Mean    =        1.285, StdDeviation   =        0.657]
#[Max     =        4.260, Total count    =      3974959]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5987714 requests in 30.00s, 1.51GB read
Requests/sec: 199590.88
Transfer/sec:     51.58MB